- `TIME`
- `DATE`
- `TIMESTAMP`
- `TIMESTAMPTZ`


- `TIMEZONE`
- `NOW`
- `TIMEOFDAY`
- `CURRENT_TIME`
- `CURRENT_DATE`

In [5]:
# Libraries
import pandas as pd
import sqlite3

cnx = sqlite3.connect('./data/jobs.db')

# Definimos la función para hacer queries.
def sql_query(query):
    return pd.read_sql(query, cnx)

Count all number of Monday in table jobs.

dow = Day Of Week
Sunday starts at 0, therefore Monday would be 1

In [ ]:
query = """
SELECT COUNT(Date)
FROM jobs
WHERE EXTRACT(dow FROM Date) =1

"""
sql_query(query)

In [9]:
query = """
SELECT strftime('%Y', Date)
FROM jobs

"""
sql_query(query)

     strftime('%Y', Date)
0                    2023
1                    2023
2                    2023
3                    2023
4                    2023
...                   ...
9995                 2023
9996                 2023
9997                 2023
9998                 2023
9999                 2023

[10000 rows x 1 columns]

- `EXTRACT()`
    - Allows you to "extract" or obtain a sub-component of a date value
        - `YEAR`
        - `MONTH`
        - `DAY`
        - `WEEK`
        - `QUARTER`

- `AGE()`
    - Calculates and returns the current age given a timestamp
        - `AGE (date_col)`

- `TO_CHAR()`
    - General function to convert data types to text
    - Useful for timestamp formatting
    - Usage
        - `TO_CHAR(date_col, "mm-dd-yyyy`)

`SUBQUERY`

In [ ]:
SELECT student,grade
FROM test_scores
WHERE grade > (SELECT AVG(grade))
FROM test_scores)